In [14]:
import pandas as pd
import numpy as np 
import warnings
warnings.filterwarnings('ignore')

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', np.nan],
    'Age': [25, 30, np.nan, 40, 35, 28],
    'Salary': [50000, 60000, 55000, np.nan, 70000, 65000],
    'City': ['New York', 'New York', 'Chicago', np.nan, 'Houston', 'Chicago'],
    'Department': ['HR', 'IT', 'HR', 'Finance', 'IT', 'Finance'],
    'Gender': ['Female', 'Male', 'Male', 'Male', 'Female', 'Female'],
    'joiningDate': ['2020-01-15', '2019/03/10', '2021-06-20', '2018-11-05', '2020-07-30', '2019-12-01'],
    'wifeName': ['sarina', 'Alice', np.nan, 'Eve', np.nan, 'mia'],
    'wifeAge': [28, 25, np.nan, 30, np.nan, 24]
}
df = pd.DataFrame(data)
print(df)

      Name   Age   Salary      City Department  Gender joiningDate wifeName  \
0    Alice  25.0  50000.0  New York         HR  Female  2020-01-15   sarina
1      Bob  30.0  60000.0  New York         IT    Male  2019/03/10    Alice
2  Charlie   NaN  55000.0   Chicago         HR    Male  2021-06-20      NaN
3    David  40.0      NaN       NaN    Finance    Male  2018-11-05      Eve
4      Eve  35.0  70000.0   Houston         IT  Female  2020-07-30      NaN
5      NaN  28.0  65000.0   Chicago    Finance  Female  2019-12-01      mia

   wifeAge
0     28.0
1     25.0
2      NaN
3     30.0
4      NaN
5     24.0

In [15]:
# Data Ingestion (Loading Data)
# Ingestion means reading data from various sources into a pandas DataFrame.
# pd.read_csv('file.csv'): Load CSV files. Use sep=',' for custom delimiters
# pd.read_excel('file.xlsx'): Load Excel files.
# pd.read_json('file.json'): Load JSON data.

In [ ]:
df.head()
df.tail()
print("\info :\n")
df.info()
df.shape
df.describe()
df.select_dtypes(include="number")
df.select_dtypes(include="object")
df.isnull().sum()
df["City"].value_counts()

\info :

<class 'pandas.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         5 non-null      str
 1   Age          5 non-null      float64
 2   Salary       5 non-null      float64
 3   City         5 non-null      str
 4   Department   6 non-null      str
 5   Gender       6 non-null      str
 6   joiningDate  6 non-null      str
 7   wifeName     4 non-null      str
 8   wifeAge      4 non-null      float64
dtypes: float64(3), str(6)
memory usage: 564.0 bytes

Name           1
Age            1
Salary         1
City           1
Department     0
Gender         0
joiningDate    0
wifeName       2
wifeAge        2
dtype: int64

In [19]:
df["Age"] = df["Age"].fillna(df["Age"].mean())
df["Salary"] = df["Salary"].fillna(df["Salary"].median())
df["City"] = df["City"].fillna(df["City"].mode()[0])

print("\nAfter handling missing values:\n")
print(df)

After handling missing values:

      Name   Age   Salary      City Department  Gender joiningDate wifeName  \
0    Alice  25.0  50000.0  New York         HR  Female  2020-01-15   sarina
1      Bob  30.0  60000.0  New York         IT    Male  2019/03/10    Alice
2  Charlie  31.6  55000.0   Chicago         HR    Male  2021-06-20      NaN
3    David  40.0  60000.0   Chicago    Finance    Male  2018-11-05      Eve
4      Eve  35.0  70000.0   Houston         IT  Female  2020-07-30      NaN
5      NaN  28.0  65000.0   Chicago    Finance  Female  2019-12-01      mia

   wifeAge
0     28.0
1     25.0
2      NaN
3     30.0
4      NaN
5     24.0

In [ ]:

# df.dropna(axis=1)   # drop columns
# df.drop_duplicates()
# df.rename(columns={"old": "new"}, inplace=True)
df["Age"] = df["Age"].astype(int)
# df["joiningDate"] = pd.to_datetime(df["joiningDate"])
df["joiningDate"] = pd.to_datetime(df["joiningDate"], errors="coerce")
print("\nAfter type conversion:\n")
print(df)
# df.dropna()
# print("\nAfter dropping rows with missing values:\n")
# print(df)

After type conversion:

      Name  Age   Salary      City Department  Gender joiningDate wifeName  \
0    Alice   25  50000.0  New York         HR  Female  2020-01-15   sarina
1      Bob   30  60000.0  New York         IT    Male         NaT    Alice
2  Charlie   31  55000.0   Chicago         HR    Male  2021-06-20      NaN
3    David   40  60000.0   Chicago    Finance    Male  2018-11-05      Eve
4      Eve   35  70000.0   Houston         IT  Female  2020-07-30      NaN
5      NaN   28  65000.0   Chicago    Finance  Female  2019-12-01      mia

   wifeAge
0     28.0
1     25.0
2      NaN
3     30.0
4      NaN
5     24.0

City
Chicago     3
New York    2
Houston     1
Name: count, dtype: int64

In [ ]:
df.groupby("city").agg({
    "salary": "mean",
    "age": "max"
})